wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32M140FX.h
typedef struct
{
    __IO uint16_t C0BUFEN                   : 2;
    __IO uint16_t C1BUFEN                   : 2;
    __IO uint16_t M0BUFEN                   : 2;
    __IO uint16_t M1BUFEN                   : 2;
    __IO uint16_t LMC0                      : 1;
    __IO uint16_t LMC1                      : 1;
    __IO uint16_t LMM0                      : 1;
    __IO uint16_t LMM1                      : 1;
    __IO uint16_t MCEC0                     : 1;
    __IO uint16_t MCEC1                     : 1;
} stc_timer4_ocer10_field_t;

typedef struct
{
    __IO uint8_t OCE0                       : 1;
    __IO uint8_t OCE1                       : 1;
    __IO uint8_t OCP0                       : 1;
    __IO uint8_t OCP1                       : 1;
    __IO uint8_t OCIE0                      : 1;
    __IO uint8_t OCIE1                      : 1;
    __IO uint8_t OCF0                       : 1;
    __IO uint8_t OCF1                       : 1;
} stc_timer4_ocsr32_field_t;

typedef struct
{
    __IO uint16_t C0BUFEN                   : 2;
    __IO uint16_t C1BUFEN                   : 2;
    __IO uint16_t M0BUFEN                   : 2;
    __IO uint16_t M1BUFEN                   : 2;
    __IO uint16_t LMC0                      : 1;
    __IO uint16_t LMC1                      : 1;
    __IO uint16_t LMM0                      : 1;
    __IO uint16_t LMM1                      : 1;
    __IO uint16_t MCEC0                     : 1;
    __IO uint16_t MCEC1                     : 1;
} stc_timer4_ocer32_field_t;

typedef struct
{
    __IO uint8_t OCE0                       : 1;
    __IO uint8_t OCE1                       : 1;
    __IO uint8_t OCP0                       : 1;
    __IO uint8_t OCP1                       : 1;
    __IO uint8_t OCIE0                      : 1;
    __IO uint8_t OCIE1                      : 1;
    __IO uint8_t OCF0                       : 1;
    __IO uint8_t OCF1                       : 1;
} stc_timer4_ocsr54_field_t;

typedef struct
{
    __IO uint16_t C0BUFEN                   : 2;
    __IO uint16_t C1BUFEN                   : 2;
    __IO uint16_t M0BUFEN                   : 2;
    __IO uint16_t M1BUFEN                   : 2;
    __IO uint16_t LMC0                      : 1;
    __IO uint16_t LMC1                      : 1;
    __IO uint16_t LMM0                      : 1;
    __IO uint16_t LMM1                      : 1;
    __IO uint16_t MCEC0                     : 1;
    __IO uint16_t MCEC1                     : 1;
} stc_timer4_ocer54_field_t;

typedef struct
{
    __IO uint16_t OCMR                      :16;
} stc_timer4_ocmr0_field_t;

typedef struct
{
    __IO uint32_t OCMR                      :32;
} stc_timer4_ocmr1_field_t;

typedef struct
{
    __IO uint16_t OCMR                      :16;
} stc_timer4_ocmr2_field_t;

typedef struct
{
    __IO uint32_t OCMR                      :32;
} stc_timer4_ocmr3_field_t;

typedef struct
{
    __IO uint16_t OCMR                      :16;
} stc_timer4_ocmr4_field_t;

typedef struct
{
    __IO uint32_t OCMR                      :32;
} stc_timer4_ocmr5_field_t;

typedef struct
{
    __IO uint16_t DCLK                      : 4;
    __IO uint16_t CLEAR                     : 1;
    __IO uint16_t CNTMD                     : 1;
    __IO uint16_t STOP                      : 1;
    __IO uint16_t BUFEN                     : 1;
    __IO uint16_t ICLEN                     : 1;
    __IO uint16_t ICLR                      : 1;
    uint16_t RESERVED10                     : 3;
    __IO uint16_t IRQZEN                    : 1;
    __IO uint16_t IRQZF                     : 1;
    __IO uint16_t ECKEN                     : 1;
} stc_timer4_ccsr_field_t;

typedef struct
{
    __IO uint16_t ZIM                       : 4;
    __IO uint16_t PIM                       : 4;
    __IO uint16_t ZIC                       : 4;
    __IO uint16_t PIC                       : 4;
} stc_timer4_cimr_field_t;

typedef struct
{
    __IO uint8_t DIVCK                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t WMD                        : 2;
    __IO uint8_t LVLS                       : 2;
} stc_timer4_pocr10_field_t;

typedef struct
{
    __IO uint8_t DIVCK                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t WMD                        : 2;
    __IO uint8_t LVLS                       : 2;
} stc_timer4_pocr32_field_t;

typedef struct
{
    __IO uint8_t DIVCK                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t WMD                        : 2;
    __IO uint8_t LVLS                       : 2;
} stc_timer4_pocr54_field_t;

typedef struct
{
    __IO uint16_t RTID10                    : 1;
    __IO uint16_t RTID32                    : 1;
    __IO uint16_t RTID54                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t RTIF10                    : 1;
    __IO uint16_t RTIC10                    : 1;
    __IO uint16_t RTE10                     : 1;
    __IO uint16_t RTS10                     : 1;
    __IO uint16_t RTIF32                    : 1;
    __IO uint16_t RTIC32                    : 1;
    __IO uint16_t RTE32                     : 1;
    __IO uint16_t RTS32                     : 1;
    __IO uint16_t RTIF54                    : 1;
    __IO uint16_t RTIC54                    : 1;
    __IO uint16_t RTE54                     : 1;
    __IO uint16_t RTS54                     : 1;
} stc_timer4_rcsr_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr0_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater0_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr0_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr1_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater1_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr1_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr2_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater2_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr2_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr3_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater3_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr3_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr4_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater4_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr4_field_t;

typedef struct
{
    __IO uint8_t BUFEN                      : 2;
    __IO uint8_t ADTRGS                     : 3;
    __IO uint8_t LMC                        : 1;
} stc_timer4_atcr5_field_t;

typedef struct
{
    __IO uint8_t TRGMD                      : 1;
    __IO uint8_t OCS                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t DEN                        : 1;
    __IO uint8_t PEN                        : 1;
    __IO uint8_t UEN                        : 1;
    __IO uint8_t ZEN                        : 1;
} stc_timer4_ater5_field_t;

typedef struct
{
    __IO uint8_t AMC                        : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCE                       : 1;
    __IO uint8_t MPCE                       : 1;
} stc_timer4_atmr5_field_t;

typedef struct
{
    __IO uint16_t DPE                       : 1;
    __IO uint16_t NCS                       : 3;
    __IO uint16_t SDI                       : 1;
    __IO uint16_t APE                       : 1;
    uint16_t RESERVED6                      : 1;
    __IO uint16_t HOLD                      : 1;
    __IO uint16_t DID                       : 1;
    __IO uint16_t AID                       : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DIF                       : 1;
    __IO uint16_t DIFC                      : 1;
    __IO uint16_t AIF                       : 1;
    __IO uint16_t AIFC                      : 1;
} stc_timer4_escr_field_t;

typedef struct
{
    __IO uint32_t UID                       :32;
} stc_uid_uidr0_field_t;

typedef struct
{
    __IO uint32_t UID                       :32;
} stc_uid_uidr1_field_t;

typedef struct
{
    __IO uint32_t UID                       :16;
} stc_uid_uidr2_field_t;

typedef struct
{
    __IO uint8_t VC_EN                      : 1;
    __IO uint8_t VC_OUT                     : 1;
    __IO uint8_t VC_NMODE                   : 1;
    __IO uint8_t VC_COMPSL                  : 2;
} stc_vc_ctl1_field_t;

typedef struct
{
    __IO uint16_t VC_FILTER_EN              : 1;
    __IO uint16_t VC_RESPONSE               : 3;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t VCINT_EDGE                : 2;
    __IO uint16_t VCINT_HIGH                : 1;
    __IO uint16_t VC2PT                     : 1;
    __IO uint16_t VCIE                      : 1;
    __IO uint16_t VCIF                      : 1;
    __IO uint16_t VC_HYS_SEL                : 1;
} stc_vc_ctl2_field_t;

typedef struct
{
    __IO uint8_t VC_TM0G                    : 1;
    __IO uint8_t VC_TM2G                    : 1;
} stc_vc_ctl3_field_t;

typedef struct
{
    __IO uint32_t LVD1_SVHR                 : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t LVD1_SVHD                 : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LVD1_SRST                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t LVD1_EN                   : 1;
} stc_wsunit_lvd1_set_field_t;

typedef struct
{
    __IO uint32_t LVD1_IF                   : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t LVD2_IF                   : 1;
} stc_wsunit_lvd_int_str_field_t;

typedef struct
{
    __IO uint32_t LVD1_CLR                  : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t LVD2_CLR                  : 1;
} stc_wsunit_lvd_clr_field_t;

typedef struct
{
    __IO uint32_t LVD2_SVHR                 : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t LVD2_SVHD                 : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LVD2_SRST                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t LVD2_EN                   : 1;
} stc_wsunit_lvd2_set_field_t;

typedef struct
{
    __IO uint8_t BUR01                      : 8;
} stc_wsunit_bur01_field_t;

typedef struct
{
    __IO uint8_t BUR02                      : 8;
} stc_wsunit_bur02_field_t;

typedef struct
{
    __IO uint8_t BUR03                      : 8;
} stc_wsunit_bur03_field_t;

typedef struct
{
    __IO uint8_t BUR04                      : 8;
} stc_wsunit_bur04_field_t;

typedef struct
{
    __IO uint8_t BUR05                      : 8;
} stc_wsunit_bur05_field_t;

typedef struct
{
    __IO uint8_t BUR06                      : 8;
} stc_wsunit_bur06_field_t;

typedef struct
{
    __IO uint8_t BUR07                      : 8;
} stc_wsunit_bur07_field_t;

typedef struct
{
    __IO uint8_t BUR08                      : 8;
} stc_wsunit_bur08_field_t;

typedef struct
{
    __IO uint8_t BUR09                      : 8;
} stc_wsunit_bur09_field_t;

typedef struct
{
    __IO uint8_t BUR10                      : 8;
} stc_wsunit_bur10_field_t;

typedef struct
{
    __IO uint8_t BUR11                      : 8;
} stc_wsunit_bur11_field_t;

typedef struct
{
    __IO uint8_t BUR12                      : 8;
} stc_wsunit_bur12_field_t;

typedef struct
{
    __IO uint8_t BUR13                      : 8;
} stc_wsunit_bur13_field_t;

typedef struct
{
    __IO uint8_t BUR14                      : 8;
} stc_wsunit_bur14_field_t;

typedef struct
{
    __IO uint8_t BUR15                      : 8;
} stc_wsunit_bur15_field_t;

typedef struct
{
    __IO uint8_t BUR16                      : 8;
} stc_wsunit_bur16_field_t;


typedef struct
{
    union
    {
        __IO uint16_t ADCTL;
        stc_adc_adctl_field_t ADCTL_f;
    };
    union
    {
        __IO uint16_t ADCINT;
        stc_adc_adcint_field_t ADCINT_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint8_t ADCSCTL;
        stc_adc_adcsctl_field_t ADCSCTL_f;
    };
    union
    {
        __IO uint8_t SFS;
        stc_adc_sfs_field_t SFS_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint32_t SFD;
        stc_adc_sfd_field_t SFD_f;
    };
    union
    {
        __IO uint32_t ADSIN0;
        stc_adc_adsin0_field_t ADSIN0_f;
        __IO uint32_t ADSIN1;
        stc_adc_adsin1_field_t ADSIN1_f;
    };
    uint8_t RESERVED7[4];
    union
    {
        __IO uint8_t ADCPCTL;
        stc_adc_adcpctl_field_t ADCPCTL_f;
    };
    union
    {
        __IO uint8_t PFS;
        stc_adc_pfs_field_t PFS_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint32_t PFD;
        stc_adc_pfd_field_t PFD_f;
    };
    union
    {
        __IO uint16_t ADPIN;
        stc_adc_adpin_field_t ADPIN_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint8_t ADCMPCTL;
        stc_adc_adcmpctl_field_t ADCMPCTL_f;
    };
    uint8_t RESERVED12[1];
    union
    {
        __IO uint16_t ADCMPD;
        stc_adc_adcmpd_field_t ADCMPD_f;
    };
    union
    {
        __IO uint32_t STSEL;
        stc_adc_stsel_field_t STSEL_f;
    };
    uint8_t RESERVED14[4];
    union
    {
        __IO uint8_t STS0;
        stc_adc_sts0_field_t STS0_f;
    };
    union
    {
        __IO uint8_t STS1;
        stc_adc_sts1_field_t STS1_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint8_t ADCDIV;
        stc_adc_adcdiv_field_t ADCDIV_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t ADCSTSL;
        stc_adc_adcstsl_field_t ADCSTSL_f;
    };
    union
    {
        __IO uint8_t ADCPTSL;
        stc_adc_adcptsl_field_t ADCPTSL_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint16_t ADEN;
        stc_adc_aden_field_t ADEN_f;
    };
    uint8_t RESERVED20[10];
    union
    {
        __IO uint16_t ADRCMPCTL;
        stc_adc_adrcmpctl_field_t ADRCMPCTL_f;
    };
    uint8_t RESERVED21[2];
    union
    {
        __IO uint8_t ADRCMPS;
        stc_adc_adrcmps_field_t ADRCMPS_f;
    };
    uint8_t RESERVED22[3];
    union
    {
        __IO uint16_t ADRCMPL;
        stc_adc_adrcmpl_field_t ADRCMPL_f;
    };
    union
    {
        __IO uint16_t ADRCMPH;
        stc_adc_adrcmph_field_t ADRCMPH_f;
    };
    union
    {
        __IO uint32_t ADRCMPF;
        stc_adc_adrcmpf_field_t ADRCMPF_f;
    };
}M0P_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CTRL;
        stc_clock_ctrl_field_t CTRL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t CLK_STB;
        stc_clock_clk_stb_field_t CLK_STB_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint32_t LPM_CTL;
        stc_clock_lpm_ctl_field_t LPM_CTL_f;
    };
    union
    {
        __IO uint16_t STAT;
        stc_clock_stat_field_t STAT_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t BC_DIV;
        stc_clock_bc_div_field_t BC_DIV_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t APB0_CTRL;
        stc_clock_apb0_ctrl_field_t APB0_CTRL_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t APB1_CTRL;
        stc_clock_apb1_ctrl_field_t APB1_CTRL_f;
    };
    uint8_t RESERVED7[7];
    union
    {
        __IO uint8_t SWDG_CTRL;
        stc_clock_swdg_ctrl_field_t SWDG_CTRL_f;
    };
    uint8_t RESERVED8[15];
    union
    {
        __IO uint8_t CSWT;
        stc_clock_cswt_field_t CSWT_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t PSWT;
        stc_clock_pswt_field_t PSWT_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t PLL_CTL1;
        stc_clock_pll_ctl1_field_t PLL_CTL1_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t PLL_CTL2;
        stc_clock_pll_ctl2_field_t PLL_CTL2_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint16_t FCM_CTL;
        stc_clock_fcm_ctl_field_t FCM_CTL_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint8_t FCM_STR;
        stc_clock_fcm_str_field_t FCM_STR_f;
    };
    uint8_t RESERVED14[3];
    __IO uint16_t AFDWH;
    uint8_t RESERVED15[2];
    __IO uint16_t AFDWL;
    uint8_t RESERVED16[2];
    __IO uint16_t AFDC;
    uint8_t RESERVED17[2];
    union
    {
        __IO uint8_t DBWDT_CTRL;
        stc_clock_dbwdt_ctrl_field_t DBWDT_CTRL_f;
    };
    uint8_t RESERVED18[11];
    union
    {
        __IO uint8_t INT_CTRL;
        stc_clock_int_ctrl_field_t INT_CTRL_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t INT_PEND;
        stc_clock_int_pend_field_t INT_PEND_f;
    };
    uint8_t RESERVED20[3];
    union
    {
        __IO uint8_t INT_CLR;
        stc_clock_int_clr_field_t INT_CLR_f;
    };
}M0P_CLOCK_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CNTRD;
        stc_clock_counter_cntrd_field_t CNTRD_f;
    };
    union
    {
        __IO uint8_t CNTRL;
        stc_clock_counter_cntrl_field_t CNTRL_f;
    };
    union
    {
        __IO uint8_t CNTC;
        stc_clock_counter_cntc_field_t CNTC_f;
    };
    uint8_t RESERVED3[13];
    union
    {
        __IO uint16_t CNT_CLK0;
        stc_clock_counter_cnt_clk0_field_t CNT_CLK0_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t CNT_CLK1;
        stc_clock_counter_cnt_clk1_field_t CNT_CLK1_f;
    };
}M0P_CLOCK_COUNTER_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTSEL0123;
        stc_ctiosel03_ctsel0123_field_t CTSEL0123_f;
    };
}M0P_CTIOSEL03_TypeDef;

typedef struct
{
    uint8_t RESERVED0[252];
    union
    {
        __IO uint8_t CTSSSR;
        stc_ctsssr_field_t CTSSSR_f;
    };
}M0P_CTSSSR_TypeDef;

typedef struct
{
    __IO uint16_t LWRR;
    uint8_t RESERVED1[2];
    __IO uint16_t HWRR;
    uint8_t RESERVED2[2];
    __IO uint16_t TCNT;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_ppg_tcr_field_t TCR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_ppg_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_ppg_tcr2_field_t TCR2_f;
    };
}M0P_CT_PPG_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    __IO uint16_t DBUF;
    uint8_t RESERVED1[6];
    union
    {
        __IO uint16_t TCR;
        stc_ct_pwc_tcr_field_t TCR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_pwc_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_pwc_tcr2_field_t TCR2_f;
    };
}M0P_CT_PWC_TypeDef;

typedef struct
{
    __IO uint16_t CSR;
    uint8_t RESERVED1[2];
    __IO uint16_t DUT;
    uint8_t RESERVED2[2];
    __IO uint16_t TCNT;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_pwm_tcr_field_t TCR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_pwm_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_pwm_tcr2_field_t TCR2_f;
    };
}M0P_CT_PWM_TypeDef;

typedef struct
{
    __IO uint16_t CSR;
    uint8_t RESERVED1[6];
    __IO uint16_t TCNT;
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_rt_tcr_field_t TCR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_rt_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_rt_tcr2_field_t TCR2_f;
    };
}M0P_CT_RT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t DMACR;
        stc_dmac_dmacr_field_t DMACR_f;
    };
    uint8_t RESERVED1[12];
    union
    {
        __IO uint32_t DMACA0;
        stc_dmac_dmaca0_field_t DMACA0_f;
    };
    union
    {
        __IO uint32_t DMACB0;
        stc_dmac_dmacb0_field_t DMACB0_f;
    };
    union
    {
        __IO uint32_t DMACSA0;
        stc_dmac_dmacsa0_field_t DMACSA0_f;
    };
    union
    {
        __IO uint32_t DMACDA0;
        stc_dmac_dmacda0_field_t DMACDA0_f;
    };
    union
    {
        __IO uint32_t DMACA1;
        stc_dmac_dmaca1_field_t DMACA1_f;
    };
    union
    {
        __IO uint32_t DMACB1;
        stc_dmac_dmacb1_field_t DMACB1_f;
    };
    union
    {
        __IO uint32_t DMACSA1;
        stc_dmac_dmacsa1_field_t DMACSA1_f;
    };
    union
    {
        __IO uint32_t DMACDA1;
        stc_dmac_dmacda1_field_t DMACDA1_f;
    };
}M0P_DMAC_TypeDef;

