wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32M140FX.h
#define bM0P_MSC5_SPI_BRS_BRS4                          *((volatile unsigned int*)(0x426E2190UL))
#define bM0P_MSC5_SPI_BRS_BRS5                          *((volatile unsigned int*)(0x426E2194UL))
#define bM0P_MSC5_SPI_BRS_BRS6                          *((volatile unsigned int*)(0x426E2198UL))
#define bM0P_MSC5_SPI_BRS_BRS7                          *((volatile unsigned int*)(0x426E219CUL))
#define bM0P_MSC5_SPI_BRS_BRS8                          *((volatile unsigned int*)(0x426E21A0UL))
#define bM0P_MSC5_SPI_BRS_BRS9                          *((volatile unsigned int*)(0x426E21A4UL))
#define bM0P_MSC5_SPI_BRS_BRS10                         *((volatile unsigned int*)(0x426E21A8UL))
#define bM0P_MSC5_SPI_BRS_BRS11                         *((volatile unsigned int*)(0x426E21ACUL))
#define bM0P_MSC5_SPI_BRS_BRS12                         *((volatile unsigned int*)(0x426E21B0UL))
#define bM0P_MSC5_SPI_BRS_BRS13                         *((volatile unsigned int*)(0x426E21B4UL))
#define bM0P_MSC5_SPI_BRS_BRS14                         *((volatile unsigned int*)(0x426E21B8UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY0                    *((volatile unsigned int*)(0x426E2380UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY1                    *((volatile unsigned int*)(0x426E2384UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x426E2388UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x426E238CUL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x426E2390UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x426E2394UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x426E2398UL))
#define bM0P_MSC5_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x426E239CUL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x426E23A0UL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x426E23A4UL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x426E23A8UL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x426E23ACUL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x426E23B0UL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x426E23B4UL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x426E23B8UL))
#define bM0P_MSC5_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x426E23BCUL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x426E2400UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x426E2404UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x426E2408UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x426E240CUL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x426E2410UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x426E2414UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x426E2418UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x426E241CUL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x426E2420UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x426E2424UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x426E2428UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x426E242CUL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x426E2430UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x426E2434UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x426E2438UL))
#define bM0P_MSC5_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x426E243CUL))
#define bM0P_MSC5_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x426E2480UL))
#define bM0P_MSC5_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x426E2484UL))
#define bM0P_MSC5_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x426E2488UL))
#define bM0P_MSC5_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x426E248CUL))
#define bM0P_MSC5_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x426E2490UL))
#define bM0P_MSC5_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x426E2498UL))
#define bM0P_MSC5_SPI_EACR_TIE                          *((volatile unsigned int*)(0x426E249CUL))
#define bM0P_MSC5_SPI_EACR_TIF                          *((volatile unsigned int*)(0x426E24A0UL))
#define bM0P_MSC5_SPI_EACR_CSER                         *((volatile unsigned int*)(0x426E24ACUL))
#define bM0P_MSC5_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x426E24B0UL))
#define bM0P_MSC5_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x426E24B4UL))
#define bM0P_MSC5_SPI_TMR_TMR0                          *((volatile unsigned int*)(0x426E2500UL))
#define bM0P_MSC5_SPI_TMR_TMR1                          *((volatile unsigned int*)(0x426E2504UL))
#define bM0P_MSC5_SPI_TMR_TMR2                          *((volatile unsigned int*)(0x426E2508UL))
#define bM0P_MSC5_SPI_TMR_TMR3                          *((volatile unsigned int*)(0x426E250CUL))
#define bM0P_MSC5_SPI_TMR_TMR4                          *((volatile unsigned int*)(0x426E2510UL))
#define bM0P_MSC5_SPI_TMR_TMR5                          *((volatile unsigned int*)(0x426E2514UL))
#define bM0P_MSC5_SPI_TMR_TMR6                          *((volatile unsigned int*)(0x426E2518UL))
#define bM0P_MSC5_SPI_TMR_TMR7                          *((volatile unsigned int*)(0x426E251CUL))
#define bM0P_MSC5_SPI_TMR_TMR8                          *((volatile unsigned int*)(0x426E2520UL))
#define bM0P_MSC5_SPI_TMR_TMR9                          *((volatile unsigned int*)(0x426E2524UL))
#define bM0P_MSC5_SPI_TMR_TMR10                         *((volatile unsigned int*)(0x426E2528UL))
#define bM0P_MSC5_SPI_TMR_TMR11                         *((volatile unsigned int*)(0x426E252CUL))
#define bM0P_MSC5_SPI_TMR_TMR12                         *((volatile unsigned int*)(0x426E2530UL))
#define bM0P_MSC5_SPI_TMR_TMR13                         *((volatile unsigned int*)(0x426E2534UL))
#define bM0P_MSC5_SPI_TMR_TMR14                         *((volatile unsigned int*)(0x426E2538UL))
#define bM0P_MSC5_SPI_TMR_TMR15                         *((volatile unsigned int*)(0x426E253CUL))
#define bM0P_MSC5_SPI_TMC_TMC0                          *((volatile unsigned int*)(0x426E2580UL))
#define bM0P_MSC5_SPI_TMC_TMC1                          *((volatile unsigned int*)(0x426E2584UL))
#define bM0P_MSC5_SPI_TMC_TMC2                          *((volatile unsigned int*)(0x426E2588UL))
#define bM0P_MSC5_SPI_TMC_TMC3                          *((volatile unsigned int*)(0x426E258CUL))
#define bM0P_MSC5_SPI_TMC_TMC4                          *((volatile unsigned int*)(0x426E2590UL))
#define bM0P_MSC5_SPI_TMC_TMC5                          *((volatile unsigned int*)(0x426E2594UL))
#define bM0P_MSC5_SPI_TMC_TMC6                          *((volatile unsigned int*)(0x426E2598UL))
#define bM0P_MSC5_SPI_TMC_TMC7                          *((volatile unsigned int*)(0x426E259CUL))
#define bM0P_MSC5_SPI_TMC_TMC8                          *((volatile unsigned int*)(0x426E25A0UL))
#define bM0P_MSC5_SPI_TMC_TMC9                          *((volatile unsigned int*)(0x426E25A4UL))
#define bM0P_MSC5_SPI_TMC_TMC10                         *((volatile unsigned int*)(0x426E25A8UL))
#define bM0P_MSC5_SPI_TMC_TMC11                         *((volatile unsigned int*)(0x426E25ACUL))
#define bM0P_MSC5_SPI_TMC_TMC12                         *((volatile unsigned int*)(0x426E25B0UL))
#define bM0P_MSC5_SPI_TMC_TMC13                         *((volatile unsigned int*)(0x426E25B4UL))
#define bM0P_MSC5_SPI_TMC_TMC14                         *((volatile unsigned int*)(0x426E25B8UL))
#define bM0P_MSC5_SPI_TMC_TMC15                         *((volatile unsigned int*)(0x426E25BCUL))
#define bM0P_MSC5_SPI_CSCR_CSOE                         *((volatile unsigned int*)(0x426E2600UL))
#define bM0P_MSC5_SPI_CSCR_CSEN0                        *((volatile unsigned int*)(0x426E2604UL))
#define bM0P_MSC5_SPI_CSCR_CSEN1                        *((volatile unsigned int*)(0x426E2608UL))
#define bM0P_MSC5_SPI_CSCR_CSEN2                        *((volatile unsigned int*)(0x426E260CUL))
#define bM0P_MSC5_SPI_CSCR_CSEN3                        *((volatile unsigned int*)(0x426E2610UL))
#define bM0P_MSC5_SPI_CSCR_CSLVS                        *((volatile unsigned int*)(0x426E2614UL))
#define bM0P_MSC5_SPI_CSCR_CSTODIV0                     *((volatile unsigned int*)(0x426E2618UL))
#define bM0P_MSC5_SPI_CSCR_CSTODIV1                     *((volatile unsigned int*)(0x426E261CUL))
#define bM0P_MSC5_SPI_CSCR_CSTODIV2                     *((volatile unsigned int*)(0x426E2620UL))
#define bM0P_MSC5_SPI_CSCR_CSAH                         *((volatile unsigned int*)(0x426E2624UL))
#define bM0P_MSC5_SPI_CSCR_CASD0                        *((volatile unsigned int*)(0x426E2628UL))
#define bM0P_MSC5_SPI_CSCR_CASD1                        *((volatile unsigned int*)(0x426E262CUL))
#define bM0P_MSC5_SPI_CSCR_CSAE0                        *((volatile unsigned int*)(0x426E2630UL))
#define bM0P_MSC5_SPI_CSCR_CSAE1                        *((volatile unsigned int*)(0x426E2634UL))
#define bM0P_MSC5_SPI_CSCR_CSAS0                        *((volatile unsigned int*)(0x426E2638UL))
#define bM0P_MSC5_SPI_CSCR_CSAS1                        *((volatile unsigned int*)(0x426E263CUL))
#define bM0P_MSC5_SPI_CSFR0_CS1DL0                      *((volatile unsigned int*)(0x426E2680UL))
#define bM0P_MSC5_SPI_CSFR0_CS1DL1                      *((volatile unsigned int*)(0x426E2684UL))
#define bM0P_MSC5_SPI_CSFR0_CS1DL2                      *((volatile unsigned int*)(0x426E2688UL))
#define bM0P_MSC5_SPI_CSFR0_CS1DL3                      *((volatile unsigned int*)(0x426E268CUL))
#define bM0P_MSC5_SPI_CSFR0_CS1TDS                      *((volatile unsigned int*)(0x426E2690UL))
#define bM0P_MSC5_SPI_CSFR0_CS1SPI                      *((volatile unsigned int*)(0x426E2694UL))
#define bM0P_MSC5_SPI_CSFR0_CS1CINV                     *((volatile unsigned int*)(0x426E2698UL))
#define bM0P_MSC5_SPI_CSFR0_CS1CSLVS                    *((volatile unsigned int*)(0x426E269CUL))
#define bM0P_MSC5_SPI_CSFR1_CS2DL0                      *((volatile unsigned int*)(0x426E26A0UL))
#define bM0P_MSC5_SPI_CSFR1_CS2DL1                      *((volatile unsigned int*)(0x426E26A4UL))
#define bM0P_MSC5_SPI_CSFR1_CS2DL2                      *((volatile unsigned int*)(0x426E26A8UL))
#define bM0P_MSC5_SPI_CSFR1_CS2DL3                      *((volatile unsigned int*)(0x426E26ACUL))
#define bM0P_MSC5_SPI_CSFR1_CS2TDS                      *((volatile unsigned int*)(0x426E26B0UL))
#define bM0P_MSC5_SPI_CSFR1_CS2SPI                      *((volatile unsigned int*)(0x426E26B4UL))
#define bM0P_MSC5_SPI_CSFR1_CS2CINV                     *((volatile unsigned int*)(0x426E26B8UL))
#define bM0P_MSC5_SPI_CSFR1_CS2CSLVS                    *((volatile unsigned int*)(0x426E26BCUL))
#define bM0P_MSC5_SPI_CSFR2_CS3DL0                      *((volatile unsigned int*)(0x426E2700UL))
#define bM0P_MSC5_SPI_CSFR2_CS3DL1                      *((volatile unsigned int*)(0x426E2704UL))
#define bM0P_MSC5_SPI_CSFR2_CS3DL2                      *((volatile unsigned int*)(0x426E2708UL))
#define bM0P_MSC5_SPI_CSFR2_CS3DL3                      *((volatile unsigned int*)(0x426E270CUL))
#define bM0P_MSC5_SPI_CSFR2_CS3TDS                      *((volatile unsigned int*)(0x426E2710UL))
#define bM0P_MSC5_SPI_CSFR2_CS3SPI                      *((volatile unsigned int*)(0x426E2714UL))
#define bM0P_MSC5_SPI_CSFR2_CS3CINV                     *((volatile unsigned int*)(0x426E2718UL))
#define bM0P_MSC5_SPI_CSFR2_CS3CSLVS                    *((volatile unsigned int*)(0x426E271CUL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT00                  *((volatile unsigned int*)(0x426E2780UL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT01                  *((volatile unsigned int*)(0x426E2784UL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT02                  *((volatile unsigned int*)(0x426E2788UL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT03                  *((volatile unsigned int*)(0x426E278CUL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT04                  *((volatile unsigned int*)(0x426E2790UL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT05                  *((volatile unsigned int*)(0x426E2794UL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT06                  *((volatile unsigned int*)(0x426E2798UL))
#define bM0P_MSC5_SPI_TDTCNT0_TDTCNT07                  *((volatile unsigned int*)(0x426E279CUL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT10                  *((volatile unsigned int*)(0x426E27A0UL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT11                  *((volatile unsigned int*)(0x426E27A4UL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT12                  *((volatile unsigned int*)(0x426E27A8UL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT13                  *((volatile unsigned int*)(0x426E27ACUL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT14                  *((volatile unsigned int*)(0x426E27B0UL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT15                  *((volatile unsigned int*)(0x426E27B4UL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT16                  *((volatile unsigned int*)(0x426E27B8UL))
#define bM0P_MSC5_SPI_TDTCNT1_TDTCNT17                  *((volatile unsigned int*)(0x426E27BCUL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT20                  *((volatile unsigned int*)(0x426E2800UL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT21                  *((volatile unsigned int*)(0x426E2804UL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT22                  *((volatile unsigned int*)(0x426E2808UL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT23                  *((volatile unsigned int*)(0x426E280CUL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT24                  *((volatile unsigned int*)(0x426E2810UL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT25                  *((volatile unsigned int*)(0x426E2814UL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT26                  *((volatile unsigned int*)(0x426E2818UL))
#define bM0P_MSC5_SPI_TDTCNT2_TDTCNT27                  *((volatile unsigned int*)(0x426E281CUL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT30                  *((volatile unsigned int*)(0x426E2820UL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT31                  *((volatile unsigned int*)(0x426E2824UL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT32                  *((volatile unsigned int*)(0x426E2828UL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT33                  *((volatile unsigned int*)(0x426E282CUL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT34                  *((volatile unsigned int*)(0x426E2830UL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT35                  *((volatile unsigned int*)(0x426E2834UL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT36                  *((volatile unsigned int*)(0x426E2838UL))
#define bM0P_MSC5_SPI_TDTCNT3_TDTCNT37                  *((volatile unsigned int*)(0x426E283CUL))
#define bM0P_MSC6_SPI_MR_DOE                            *((volatile unsigned int*)(0x426E4000UL))
#define bM0P_MSC6_SPI_MR_CKE                            *((volatile unsigned int*)(0x426E4004UL))
#define bM0P_MSC6_SPI_MR_TDS                            *((volatile unsigned int*)(0x426E4008UL))
#define bM0P_MSC6_SPI_MR_CINV                           *((volatile unsigned int*)(0x426E400CUL))
#define bM0P_MSC6_SPI_MR_MODE0                          *((volatile unsigned int*)(0x426E4014UL))
#define bM0P_MSC6_SPI_MR_MODE1                          *((volatile unsigned int*)(0x426E4018UL))
#define bM0P_MSC6_SPI_MR_MODE2                          *((volatile unsigned int*)(0x426E401CUL))
#define bM0P_MSC6_SPI_CR_TXE                            *((volatile unsigned int*)(0x426E4020UL))
#define bM0P_MSC6_SPI_CR_RXE                            *((volatile unsigned int*)(0x426E4024UL))
#define bM0P_MSC6_SPI_CR_TBIE                           *((volatile unsigned int*)(0x426E4028UL))
#define bM0P_MSC6_SPI_CR_TXIE                           *((volatile unsigned int*)(0x426E402CUL))
#define bM0P_MSC6_SPI_CR_RXIE                           *((volatile unsigned int*)(0x426E4030UL))
#define bM0P_MSC6_SPI_CR_SPIMODE                        *((volatile unsigned int*)(0x426E4034UL))
#define bM0P_MSC6_SPI_CR_MSS                            *((volatile unsigned int*)(0x426E4038UL))
#define bM0P_MSC6_SPI_CR_PCL                            *((volatile unsigned int*)(0x426E403CUL))
#define bM0P_MSC6_SPI_ECR_DL0                           *((volatile unsigned int*)(0x426E4080UL))
#define bM0P_MSC6_SPI_ECR_DL1                           *((volatile unsigned int*)(0x426E4084UL))
#define bM0P_MSC6_SPI_ECR_DL2                           *((volatile unsigned int*)(0x426E4088UL))
#define bM0P_MSC6_SPI_ECR_DTRWS0                        *((volatile unsigned int*)(0x426E408CUL))
#define bM0P_MSC6_SPI_ECR_DTRWS1                        *((volatile unsigned int*)(0x426E4090UL))
#define bM0P_MSC6_SPI_ECR_CSFE                          *((volatile unsigned int*)(0x426E4094UL))
#define bM0P_MSC6_SPI_ECR_DL3                           *((volatile unsigned int*)(0x426E4098UL))
#define bM0P_MSC6_SPI_ECR_SOPS                          *((volatile unsigned int*)(0x426E409CUL))
#define bM0P_MSC6_SPI_SR_TBIF                           *((volatile unsigned int*)(0x426E40A0UL))
#define bM0P_MSC6_SPI_SR_TDEF                           *((volatile unsigned int*)(0x426E40A4UL))
#define bM0P_MSC6_SPI_SR_RDFF                           *((volatile unsigned int*)(0x426E40A8UL))
#define bM0P_MSC6_SPI_SR_ORF                            *((volatile unsigned int*)(0x426E40ACUL))
#define bM0P_MSC6_SPI_SR_RECLR                          *((volatile unsigned int*)(0x426E40BCUL))
#define bM0P_MSC6_SPI_BRS_BRS0                          *((volatile unsigned int*)(0x426E4180UL))
#define bM0P_MSC6_SPI_BRS_BRS1                          *((volatile unsigned int*)(0x426E4184UL))
#define bM0P_MSC6_SPI_BRS_BRS2                          *((volatile unsigned int*)(0x426E4188UL))
#define bM0P_MSC6_SPI_BRS_BRS3                          *((volatile unsigned int*)(0x426E418CUL))
#define bM0P_MSC6_SPI_BRS_BRS4                          *((volatile unsigned int*)(0x426E4190UL))
#define bM0P_MSC6_SPI_BRS_BRS5                          *((volatile unsigned int*)(0x426E4194UL))
#define bM0P_MSC6_SPI_BRS_BRS6                          *((volatile unsigned int*)(0x426E4198UL))
#define bM0P_MSC6_SPI_BRS_BRS7                          *((volatile unsigned int*)(0x426E419CUL))
#define bM0P_MSC6_SPI_BRS_BRS8                          *((volatile unsigned int*)(0x426E41A0UL))
#define bM0P_MSC6_SPI_BRS_BRS9                          *((volatile unsigned int*)(0x426E41A4UL))
#define bM0P_MSC6_SPI_BRS_BRS10                         *((volatile unsigned int*)(0x426E41A8UL))
#define bM0P_MSC6_SPI_BRS_BRS11                         *((volatile unsigned int*)(0x426E41ACUL))
#define bM0P_MSC6_SPI_BRS_BRS12                         *((volatile unsigned int*)(0x426E41B0UL))
#define bM0P_MSC6_SPI_BRS_BRS13                         *((volatile unsigned int*)(0x426E41B4UL))
#define bM0P_MSC6_SPI_BRS_BRS14                         *((volatile unsigned int*)(0x426E41B8UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY0                    *((volatile unsigned int*)(0x426E4380UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY1                    *((volatile unsigned int*)(0x426E4384UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x426E4388UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x426E438CUL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x426E4390UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x426E4394UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x426E4398UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x426E439CUL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x426E43A0UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x426E43A4UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x426E43A8UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x426E43ACUL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x426E43B0UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x426E43B4UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x426E43B8UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x426E43BCUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x426E4400UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x426E4404UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x426E4408UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x426E440CUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x426E4410UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x426E4414UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x426E4418UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x426E441CUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x426E4420UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x426E4424UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x426E4428UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x426E442CUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x426E4430UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x426E4434UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x426E4438UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x426E443CUL))
#define bM0P_MSC6_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x426E4480UL))
#define bM0P_MSC6_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x426E4484UL))
#define bM0P_MSC6_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x426E4488UL))
#define bM0P_MSC6_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x426E448CUL))
#define bM0P_MSC6_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x426E4490UL))
#define bM0P_MSC6_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x426E4498UL))
#define bM0P_MSC6_SPI_EACR_TIE                          *((volatile unsigned int*)(0x426E449CUL))
#define bM0P_MSC6_SPI_EACR_TIF                          *((volatile unsigned int*)(0x426E44A0UL))
#define bM0P_MSC6_SPI_EACR_CSER                         *((volatile unsigned int*)(0x426E44ACUL))
#define bM0P_MSC6_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x426E44B0UL))
#define bM0P_MSC6_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x426E44B4UL))
